examples/plasma-jet/free-jet/1_flow/0.org/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.8;

boundaryField
{
    gasInlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    airInlet
    {
        type            fixedValue;
        value           uniform 0.8;
    }

    region0_to_dielectric
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    topBoundary
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    axis
    {
        type            empty;
    }

    frontWedge
    {
        type            wedge;
    }

    backWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
