examples/plasma-jet/free-jet/1_flow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Tube's exit
    {
        name    tubeExitSet;
        type    faceSet;
        action  new;
        source  cylinderToFace;
        sourceInfo
        {
            p1 (0.0 0.0 4.99e-3);
            p2 (0.0 0.0 5.01e-3);
            radius 0.3e-3;
        }
    }
    {
        name    tubeExitZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet tubeExitSet;
        }
    }
);

// ************************************************************************* //
